In [35]:
#Pandas DataFrame

In [54]:
import pandas as pd
df = pd.DataFrame(columns=["name", "weight", "height", "birth_year", "gender", "city"])

In [55]:
df

Empty DataFrame
Columns: [name, weight, height, birth_year, gender, city]
Index: []

In [56]:
df.loc[0] = ["ana", 42.2, 155, 2000, "female", "newyork"]
df.loc[1] = ["dane", 50.5, 160, 1997, "male", "chicago"]
df.loc[2] = ["david", 62.1, 162, 1996, "male", "austin"]
df.loc[3] = ["kevin", 64.0, 170, 1987, "male", "newyork"]
df.loc[4] = ["joe", 59.0, 167, 1998, "male", "Nan"]
df.loc[5] = ["rose", "Nan", 159, 2003, "female", "newyork"]

df

    name weight height birth_year  gender     city
0    ana   42.2    155       2000  female  newyork
1   dane   50.5    160       1997    male  chicago
2  david   62.1    162       1996    male   austin
3  kevin   64.0    170       1987    male  newyork
4    joe   59.0    167       1998    male      Nan
5   rose    Nan    159       2003  female  newyork

In [57]:
#Print the basic DataFrame info

In [58]:
df = pd.DataFrame(columns=["name", "weight", "height", "birth_year", "gender", "city"])

df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 0 entries
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        0 non-null      object
 1   weight      0 non-null      object
 2   height      0 non-null      object
 3   birth_year  0 non-null      object
 4   gender      0 non-null      object
 5   city        0 non-null      object
dtypes: object(6)
memory usage: 0.0+ bytes

In [59]:
#Print the basic statistics information for numerical columns

In [60]:
stats_numeric = df['weight'].describe()
print (stats_numeric)

count       0
unique      0
top       NaN
freq      NaN
Name: weight, dtype: object

In [61]:
stats_numeric = df['height'].describe()
print (stats_numeric)

count       0
unique      0
top       NaN
freq      NaN
Name: height, dtype: object

In [62]:
stats_numeric = df['birth_year'].describe()
print (stats_numeric)

count       0
unique      0
top       NaN
freq      NaN
Name: birth_year, dtype: object

In [63]:
stats = df.describe(include='all')
print (stats)

       name weight height birth_year gender city
count     0      0      0          0      0    0
unique    0      0      0          0      0    0
top     NaN    NaN    NaN        NaN    NaN  NaN
freq    NaN    NaN    NaN        NaN    NaN  NaN

In [64]:
#Reorder the columns to match with the following Pandas DataFrame

In [65]:
new_columns = ["name", "weight", "height", "birth_year", "gender", "city"]
df = df[new_columns]
print(df)

Empty DataFrame
Columns: [name, weight, height, birth_year, gender, city]
Index: []

In [66]:
#Print all rows that match either of the following conditions
#Men that born after the year 1996
#Women with height > 157

In [67]:
raw_data = {'name': ['ana', 'dane', 'david', 'kevin', 'joe', 'rose'],
'weight': [42.2, 50.2, 62.2, 64.0, 59.0, "Nan"],
'height': [155, 160, 162, 170, 167, 159],
'birth_year': [2000, 1997, 1996, 1987,1998, 2003],
'gender': ['female', 'male','male','male','male', 'female'],
'city': ['newyork', 'chicago', 'austin', 'newyork', 'Nan', 'newyork'],}

df = pd.DataFrame(raw_data)
df.head()

    name weight  height  birth_year  gender     city
0    ana   42.2     155        2000  female  newyork
1   dane   50.2     160        1997    male  chicago
2  david   62.2     162        1996    male   austin
3  kevin   64.0     170        1987    male  newyork
4    joe   59.0     167        1998    male      Nan

In [68]:
#Men that born after the year 1996

In [69]:
array = ['ana', 'david', 'kevin', 'rose']
df.loc[~df['name'].isin(array)]

   name weight  height  birth_year gender     city
1  dane   50.2     160        1997   male  chicago
4   joe   59.0     167        1998   male      Nan

In [70]:
#Women with height > 157

In [71]:
array = ['ana', 'dane', 'david', 'kevin', 'joe']
df.loc[~df['name'].isin(array)]

   name weight  height  birth_year  gender     city
5  rose    Nan     159        2003  female  newyork

In [33]:
#Fill NaN of height with mean of the gender and fill NaN of city with mode

In [53]:
df["height"] = df["height"].fillna(df["height"].mean())
df

    name weight  height  birth_year  gender     city
0    ana   42.2     155        2000  female  newyork
1   dane   50.2     160        1997    male  chicago
2  david   62.2     162        1996    male   austin
3  kevin   64.0     170        1987    male  newyork
4    joe   59.0     167        1998    male      Nan
5   rose    Nan     159        2003  female  newyork

In [91]:
df["city"] = df["city"].fillna(df["city"].mode()[0])
df

    name weight  height  birth_year  gender     city
0    ana   42.2     155        2000  female  newyork
1   dane   50.2     160        1997    male  chicago
2  david   62.2     162        1996    male   austin
3  kevin   64.0     170        1987    male  newyork
4    joe   59.0     167        1998    male      Nan
5   rose    Nan     159        2003  female  newyork

In [ ]:
#Check outliers of weight and remove if any

In [24]:
df = pd.DataFrame({ 'name': ['ana', 'dane', 'david', 'kevin', 'joe', 'rose'],
'weight': [42.2, 50.2, 62.2, 64.0, 59.0, "Nan"],
'height': [155, 160, 162, 170, 167, 159],
'birth_year': [2000, 1997, 1996, 1987,1998, 2003],
'gender': ['female', 'male','male','male','male', 'female'],
'city': ['newyork', 'chicago', 'austin', 'newyork', 'Nan', 'newyork'],
    
    })
df

    name weight  height  birth_year  gender     city
0    ana   42.2     155        2000  female  newyork
1   dane   50.2     160        1997    male  chicago
2  david   62.2     162        1996    male   austin
3  kevin   64.0     170        1987    male  newyork
4    joe   59.0     167        1998    male      Nan
5   rose    Nan     159        2003  female  newyork